sa3mv3g/jerry/tools/ozone/STM32H563.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<!--
Copyright (c) 2025 STMicroelectronics.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<device schemaVersion="1.1"
xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <name>STM32H563</name>
  <version>1.8</version>
  <description>STM32H563</description>
  <cpu>
    <name>CM33</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>0x20</size>
  <resetValue>0x0</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
        <name>ADC1</name>
        <description>Analog to digital converter</description>
		<groupName>ADC</groupName>
        <baseAddress>0x42028000</baseAddress>
        <addressBlock>
          <offset>0x0</offset>
          <size>0xCC</size>
          <usage>registers</usage>
        </addressBlock>
		<interrupt>
          <name>ADC1</name>
          <description>ADC1 global interrupt</description>
          <value>37</value>
        </interrupt>
		<registers>
			<register>
			  <name>ADC_ISR</name>
			  <displayName>ADC_ISR</displayName>
			  <description>ADC interrupt and status register</description>
			  <addressOffset>0x00</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>ADRDY</name>
				  <description>ADC ready
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>ADC not yet ready to start conversion (or the flag event was already acknowledged and cleared by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>ADC is ready to start conversion</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>EOSMP</name>
				  <description>End of sampling flag
	</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>not at the end of the sampling phase (or the flag event was already acknowledged and cleared by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>End of sampling phase reached</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>EOC</name>
				  <description>End of conversion flag
	</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Regular channel conversion not complete (or the flag event was already acknowledged and cleared by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Regular channel conversion complete</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>EOS</name>
				  <description>End of regular sequence flag
	</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Regular Conversions sequence not complete (or the flag event was already acknowledged and cleared by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Regular Conversions sequence complete</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OVR</name>
				  <description>ADC overrun
	</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No overrun occurred (or the flag event was already acknowledged and cleared by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Overrun has occurred</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JEOC</name>
				  <description>Injected channel end of conversion flag
	</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Injected channel conversion not complete (or the flag event was already acknowledged and cleared by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Injected channel conversion complete</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JEOS</name>
				  <description>Injected channel end of sequence flag
	</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Injected conversion sequence not complete (or the flag event was already acknowledged and cleared by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Injected conversions complete</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>AWD1</name>
				  <description>Analog watchdog 1 flag
	</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No analog watchdog 1 event occurred (or the flag event was already acknowledged and cleared by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Analog watchdog 1 event occurred</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>AWD2</name>
				  <description>Analog watchdog 2 flag
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No analog watchdog 2 event occurred (or the flag event was already acknowledged and cleared by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Analog watchdog 2 event occurred</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>AWD3</name>
				  <description>Analog watchdog 3 flag
	</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No analog watchdog 3 event occurred (or the flag event was already acknowledged and cleared by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Analog watchdog 3 event occurred</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JQOVF</name>
				  <description>Injected context queue overflow
	</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No injected context queue overflow occurred (or the flag event was already acknowledged and cleared by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Injected context queue overflow has occurred</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_IER</name>
			  <displayName>ADC_IER</displayName>
			  <description>ADC interrupt enable register</description>
			  <addressOffset>0x04</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>ADRDYIE</name>
				  <description>ADC ready interrupt enable
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>ADRDY interrupt disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>ADRDY interrupt enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>EOSMPIE</name>
				  <description>End of sampling flag interrupt enable for regular conversions
	</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>EOSMP interrupt disabled.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>EOSMP interrupt enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>EOCIE</name>
				  <description>End of regular conversion interrupt enable
	</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>EOC interrupt disabled.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>EOC interrupt enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>EOSIE</name>
				  <description>End of regular sequence of conversions interrupt enable
	</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>EOS interrupt disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>EOS interrupt enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OVRIE</name>
				  <description>Overrun interrupt enable
	</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Overrun interrupt disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Overrun interrupt enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JEOCIE</name>
				  <description>End of injected conversion interrupt enable
	</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>JEOC interrupt disabled.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>JEOC interrupt enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JEOSIE</name>
				  <description>End of injected sequence of conversions interrupt enable
	</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>JEOS interrupt disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>JEOS interrupt enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>AWD1IE</name>
				  <description>Analog watchdog 1 interrupt enable
	</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Analog watchdog 1 interrupt disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Analog watchdog 1 interrupt enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>AWD2IE</name>
				  <description>Analog watchdog 2 interrupt enable
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Analog watchdog 2 interrupt disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Analog watchdog 2 interrupt enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>AWD3IE</name>
				  <description>Analog watchdog 3 interrupt enable
	</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Analog watchdog 3 interrupt disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Analog watchdog 3 interrupt enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JQOVFIE</name>
				  <description>Injected context queue overflow interrupt enable
	</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Injected Context Queue Overflow interrupt disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Injected Context Queue Overflow interrupt enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_CR</name>
			  <displayName>ADC_CR</displayName>
			  <description>ADC control register</description>
			  <addressOffset>0x08</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x20000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>ADEN</name>
				  <description>ADC enable control
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>ADC is disabled (OFF state)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Write 1 to enable the ADC.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ADDIS</name>
				  <description>ADC disable command
	</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>no ADDIS command ongoing</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Write 1 to disable the ADC.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ADSTART</name>
				  <description>ADC start of regular conversion
	</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No ADC regular conversion is ongoing.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Write 1 to start regular conversions.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JADSTART</name>
				  <description>ADC start of injected conversion
	</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No ADC injected conversion is ongoing.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Write 1 to start injected conversions.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ADSTP</name>
				  <description>ADC stop of regular conversion command
	</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No ADC stop regular conversion command ongoing</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Write 1 to stop regular conversions ongoing.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JADSTP</name>
				  <description>ADC stop of injected conversion command
	</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No ADC stop injected conversion command ongoing</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Write 1 to stop injected conversions ongoing.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ADVREGEN</name>
				  <description>ADC voltage regulator enable
	</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>ADC Voltage regulator disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>ADC Voltage regulator enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>DEEPPWD</name>
				  <description>Deep-power-down enable
	</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>ADC not in Deep-power down</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>ADC in Deep-power-down (default reset state)</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ADCALDIF</name>
				  <description>Differential mode for calibration
	</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Writing ADCAL launches a calibration in single-ended inputs mode.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Writing ADCAL launches a calibration in Differential inputs mode.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ADCAL</name>
				  <description>ADC calibration
	</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Calibration complete</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Write 1 to calibrate the ADC.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
