sa3mv3g/jerry/tools/ozone/STM32H563.svd
			<register>
			  <name>ADC_SMPR2</name>
			  <displayName>ADC_SMPR2</displayName>
			  <description>ADC sample time register 2</description>
			  <addressOffset>0x18</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>SMP10</name>
				  <description>Channel x sampling time selection (x=19 to 10)
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>2.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>6.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>12.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>24.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>47.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>92.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>247.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>640.</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SMP11</name>
				  <description>Channel x sampling time selection (x=19 to 10)
	</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>2.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>6.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>12.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>24.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>47.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>92.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>247.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>640.</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SMP12</name>
				  <description>Channel x sampling time selection (x=19 to 10)
	</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>2.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>6.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>12.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>24.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>47.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>92.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>247.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>640.</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SMP13</name>
				  <description>Channel x sampling time selection (x=19 to 10)
	</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>2.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>6.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>12.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>24.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>47.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>92.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>247.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>640.</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SMP14</name>
				  <description>Channel x sampling time selection (x=19 to 10)
	</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>2.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>6.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>12.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>24.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>47.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>92.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>247.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>640.</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SMP15</name>
				  <description>Channel x sampling time selection (x=19 to 10)
	</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>2.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>6.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>12.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>24.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>47.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>92.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>247.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>640.</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SMP16</name>
				  <description>Channel x sampling time selection (x=19 to 10)
	</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>2.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>6.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>12.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>24.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>47.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>92.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>247.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>640.</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SMP17</name>
				  <description>Channel x sampling time selection (x=19 to 10)
	</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>2.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>6.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>12.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>24.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>47.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>92.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>247.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>640.</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SMP18</name>
				  <description>Channel x sampling time selection (x=19 to 10)
	</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>2.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>6.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>12.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>24.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>47.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>92.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>247.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>640.</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SMP19</name>
				  <description>Channel x sampling time selection (x=19 to 10)
	</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>2.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>6.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>12.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>24.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>47.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>92.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>247.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>640.</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_TR1</name>
			  <displayName>ADC_TR1</displayName>
			  <description>ADC watchdog threshold register 1</description>
			  <addressOffset>0x20</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x0FFF0000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>LT1</name>
				  <description>Analog watchdog 1 lower threshold
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>12</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>AWDFILT</name>
				  <description>Analog watchdog filtering parameter
	</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No filtering</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>two consecutive detection generates an AWDx flag or an interrupt</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>Eight consecutive detection generates an AWDx flag or an interrupt</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>HT1</name>
				  <description>Analog watchdog 1 higher threshold
	</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>12</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_TR2</name>
			  <displayName>ADC_TR2</displayName>
			  <description>ADC watchdog threshold register 2</description>
			  <addressOffset>0x24</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00FF0000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>LT2</name>
				  <description>Analog watchdog 2 lower threshold
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>8</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>HT2</name>
				  <description>Analog watchdog 2 higher threshold
	</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>8</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_TR3</name>
			  <displayName>ADC_TR3</displayName>
			  <description>ADC watchdog threshold register 3</description>
			  <addressOffset>0x28</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00FF0000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>LT3</name>
				  <description>Analog watchdog 3 lower threshold
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>8</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>HT3</name>
				  <description>Analog watchdog 3 higher threshold
	</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>8</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_SQR1</name>
			  <displayName>ADC_SQR1</displayName>
			  <description>ADC regular sequence register 1</description>
			  <addressOffset>0x30</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>L</name>
				  <description>Regular channel sequence length
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>1 conversion</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>2 conversions</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xF</name>
					  <description>16 conversions</description>
					  <value>0xF</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SQ1</name>
				  <description>1st conversion in regular sequence
	</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ2</name>
				  <description>2nd conversion in regular sequence
	</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ3</name>
				  <description>3rd conversion in regular sequence
	</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ4</name>
				  <description>4th conversion in regular sequence
	</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_SQR2</name>
			  <displayName>ADC_SQR2</displayName>
			  <description>ADC regular sequence register 2</description>
			  <addressOffset>0x34</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>SQ5</name>
				  <description>5th conversion in regular sequence
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ6</name>
				  <description>6th conversion in regular sequence
	</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ7</name>
				  <description>7th conversion in regular sequence
	</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ8</name>
				  <description>8th conversion in regular sequence
	</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ9</name>
				  <description>9th conversion in regular sequence
	</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_SQR3</name>
			  <displayName>ADC_SQR3</displayName>
			  <description>ADC regular sequence register 3</description>
			  <addressOffset>0x38</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>SQ10</name>
				  <description>10th conversion in regular sequence
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ11</name>
				  <description>11th conversion in regular sequence
	</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ12</name>
				  <description>12th conversion in regular sequence
	</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ13</name>
				  <description>13th conversion in regular sequence
	</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ14</name>
				  <description>14th conversion in regular sequence
	</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_SQR4</name>
			  <displayName>ADC_SQR4</displayName>
			  <description>ADC regular sequence register 4</description>
			  <addressOffset>0x3C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>SQ15</name>
				  <description>15th conversion in regular sequence
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQ16</name>
				  <description>16th conversion in regular sequence
	</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_DR</name>
			  <displayName>ADC_DR</displayName>
			  <description>ADC regular data register</description>
			  <addressOffset>0x40</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>RDATA</name>
				  <description>Regular data converted
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-only</access>
				</field>
			  </fields>
			</register>
