sa3mv3g/jerry/tools/ozone/STM32H563.svd
			<register>
			  <name>ADC_JSQR</name>
			  <displayName>ADC_JSQR</displayName>
			  <description>ADC injected sequence register</description>
			  <addressOffset>0x4C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>JL</name>
				  <description>Injected channel sequence length
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>1 conversion</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>2 conversions</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>3 conversions</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>4 conversions</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JEXTSEL</name>
				  <description>External Trigger Selection for injected group
	</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>adc_jext_trg0</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>adc_jext_trg1</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>adc_jext_trg2</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>adc_jext_trg3</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>adc_jext_trg4</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>adc_jext_trg5</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>adc_jext_trg6</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>adc_jext_trg7</description>
					  <value>0x7</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1F</name>
					  <description>adc_jext_trg31</description>
					  <value>0x1F</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JEXTEN</name>
				  <description>External trigger enable and polarity selection for injected channels
	</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>If JQDIS=0 (queue enabled), hardware and software trigger detection disabled.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Hardware trigger detection on the rising edge</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>Hardware trigger detection on the falling edge</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>Hardware trigger detection on both the rising and falling edges</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JSQ1</name>
				  <description>1st conversion in the injected sequence
	</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>JSQ2</name>
				  <description>2nd conversion in the injected sequence
	</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>JSQ3</name>
				  <description>3rd conversion in the injected sequence
	</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>JSQ4</name>
				  <description>4th conversion in the injected sequence
	</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_OFR1</name>
			  <displayName>ADC_OFR1</displayName>
			  <description>ADC offset 1 register</description>
			  <addressOffset>0x60</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>OFFSET</name>
				  <description>Data offset y for the channel programmed into bits OFFSET_CH[4:0]
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>12</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OFFSETPOS</name>
				  <description>Positive offset
	</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Negative offset</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Positive offset</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SATEN</name>
				  <description>Saturation enable
	</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No saturation control, offset result can be signed</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Saturation enabled, offset result unsigned and saturated at 0x000 and 0xFFF</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OFFSET_CH</name>
				  <description>Channel selection for the data offset y
	</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OFFSET_EN</name>
				  <description>Offset y enable
	</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_OFR2</name>
			  <displayName>ADC_OFR2</displayName>
			  <description>ADC offset 2 register</description>
			  <addressOffset>0x64</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>OFFSET</name>
				  <description>Data offset y for the channel programmed into bits OFFSET_CH[4:0]
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>12</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OFFSETPOS</name>
				  <description>Positive offset
	</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Negative offset</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Positive offset</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SATEN</name>
				  <description>Saturation enable
	</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No saturation control, offset result can be signed</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Saturation enabled, offset result unsigned and saturated at 0x000 and 0xFFF</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OFFSET_CH</name>
				  <description>Channel selection for the data offset y
	</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OFFSET_EN</name>
				  <description>Offset y enable
	</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_OFR3</name>
			  <displayName>ADC_OFR3</displayName>
			  <description>ADC offset 3 register</description>
			  <addressOffset>0x68</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>OFFSET</name>
				  <description>Data offset y for the channel programmed into bits OFFSET_CH[4:0]
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>12</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OFFSETPOS</name>
				  <description>Positive offset
	</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Negative offset</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Positive offset</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SATEN</name>
				  <description>Saturation enable
	</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No saturation control, offset result can be signed</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Saturation enabled, offset result unsigned and saturated at 0x000 and 0xFFF</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OFFSET_CH</name>
				  <description>Channel selection for the data offset y
	</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OFFSET_EN</name>
				  <description>Offset y enable
	</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_OFR4</name>
			  <displayName>ADC_OFR4</displayName>
			  <description>ADC offset 4 register</description>
			  <addressOffset>0x6C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>OFFSET</name>
				  <description>Data offset y for the channel programmed into bits OFFSET_CH[4:0]
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>12</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OFFSETPOS</name>
				  <description>Positive offset
	</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Negative offset</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Positive offset</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SATEN</name>
				  <description>Saturation enable
	</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No saturation control, offset result can be signed</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Saturation enabled, offset result unsigned and saturated at 0x000 and 0xFFF</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OFFSET_CH</name>
				  <description>Channel selection for the data offset y
	</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OFFSET_EN</name>
				  <description>Offset y enable
	</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_JDR1</name>
			  <displayName>ADC_JDR1</displayName>
			  <description>ADC injected channel 1 data register</description>
			  <addressOffset>0x80</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>JDATA</name>
				  <description>Injected data
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-only</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_JDR2</name>
			  <displayName>ADC_JDR2</displayName>
			  <description>ADC injected channel 2 data register</description>
			  <addressOffset>0x84</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>JDATA</name>
				  <description>Injected data
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-only</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_JDR3</name>
			  <displayName>ADC_JDR3</displayName>
			  <description>ADC injected channel 3 data register</description>
			  <addressOffset>0x88</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>JDATA</name>
				  <description>Injected data
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-only</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_JDR4</name>
			  <displayName>ADC_JDR4</displayName>
			  <description>ADC injected channel 4 data register</description>
			  <addressOffset>0x8C</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>JDATA</name>
				  <description>Injected data
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-only</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_AWD2CR</name>
			  <displayName>ADC_AWD2CR</displayName>
			  <description>ADC analog watchdog 2 configuration register</description>
			  <addressOffset>0xA0</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>AWD2CH</name>
				  <description>Analog watchdog 2 channel selection
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>20</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_AWD3CR</name>
			  <displayName>ADC_AWD3CR</displayName>
			  <description>ADC analog watchdog 3 configuration register</description>
			  <addressOffset>0xA4</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>AWD3CH</name>
				  <description>Analog watchdog 3 channel selection
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>20</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_DIFSEL</name>
			  <displayName>ADC_DIFSEL</displayName>
			  <description>ADC Differential mode selection register</description>
			  <addressOffset>0xB0</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>DIFSEL</name>
				  <description>Differential mode for channels 19 to 0.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>20</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_CALFACT</name>
			  <displayName>ADC_CALFACT</displayName>
			  <description>ADC calibration factors</description>
			  <addressOffset>0xB4</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CALFACT_S</name>
				  <description>Calibration Factors In single-ended mode
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>7</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CALFACT_D</name>
				  <description>Calibration Factors in differential mode
	</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>7</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ADC_OR</name>
			  <displayName>ADC_OR</displayName>
			  <description>ADC option register</description>
			  <addressOffset>0xC8</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>OP0</name>
				  <description>Option bit 0
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Vless thansub&gt;DDCORE less than/sub&gt;channel disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Vless thansub&gt;DDCORE less than/sub&gt;channel enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
