sa3mv3g/jerry/tools/ozone/STM32H563.svd
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBG_GPDMA2_10_STOP</name>
                <description>GPDMA2 channel 10 stop in debug</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. GPDMA2 channel 10 continues to operate while CPU is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. GPDMA2 channel 10 is frozen while CPU is in debug mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBG_GPDMA2_11_STOP</name>
                <description>GPDMA2 channel 11 stop in debug</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. GPDMA2 channel 11 continues to operate while CPU is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. GPDMA2 channel 11 is frozen while CPU is in debug mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBG_GPDMA2_12_STOP</name>
                <description>GPDMA2 channel 12 stop in debug</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. GPDMA2 channel 12 continues to operate while CPU is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. GPDMA2 channel 12 is frozen while CPU is in debug mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBG_GPDMA2_13_STOP</name>
                <description>GPDMA2 channel 13 stop in debug</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. GPDMA2 channel 13 continues to operate while CPU is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. GPDMA2 channel 13 is frozen while CPU is in debug mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBG_GPDMA2_14_STOP</name>
                <description>GPDMA2 channel 14 stop in debug</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. GPDMA2 channel 14 continues to operate while CPU is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. GPDMA2 channel 14 is frozen while CPU is in debug mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBG_GPDMA2_15_STOP</name>
                <description>GPDMA2 channel 15 stop in debug</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>normal operation. GPDMA2 channel 15 continues to operate while CPU is in debug mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>stop in debug. GPDMA2 channel 15 is frozen while CPU is in debug mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_SR</name>
            <displayName>DBGMCU_SR</displayName>
            <description>DBGMCU status register</description>
            <addressOffset>0xFC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00010003</resetValue>
            <resetMask>0xFFFF00FF</resetMask>
            <fields>
              <field>
                <name>AP_PRESENT</name>
                <description>Bit n identifies whether access port AP n is present in device
Bit n = 0: APn absent
Bit n = 1: APn present</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>AP_ENABLED</name>
                <description>Bit n identifies whether access port AP n is open (can be accessed via the debug port) or locked (debug access to the AP is blocked)
Bit n = 0: APn locked
Bit n = 1: APn enabled</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_DBG_AUTH_HOST</name>
            <displayName>DBGMCU_DBG_AUTH_HOST</displayName>
            <description>DBGMCU debug authentication mailbox host register</description>
            <addressOffset>0x100</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>MESSAGE</name>
                <description>Debug host to device mailbox message.
During debug authentication the debug host communicates with the device via this register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_DBG_AUTH_DEVICE</name>
            <displayName>DBGMCU_DBG_AUTH_DEVICE</displayName>
            <description>DBGMCU debug authentication mailbox device register</description>
            <addressOffset>0x104</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>MESSAGE</name>
                <description>Device to debug host mailbox message.
During debug authentication the device communicates with the debug host via this register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_DBG_AUTH_ACK</name>
            <displayName>DBGMCU_DBG_AUTH_ACK</displayName>
            <description>DBGMCU debug authentication mailbox acknowledge register</description>
            <addressOffset>0x108</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HOST_ACK</name>
                <description>Host to device acknowledge.
The device sets this bit to indicate that it has placed a message in the DBGMCU_DBG_AUTH_DEVICE register. It should be reset by the host after reading the message</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DEV_ACK</name>
                <description>Device to device acknowledge.
The host sets this bit to indicate that it has placed a message in the DBGMCU_DBG_AUTH_HOST register. It is reset by the device after reading the message</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR4</name>
            <displayName>DBGMCU_PIDR4</displayName>
            <description>DBGMCU CoreSight peripheral identity register 4</description>
            <addressOffset>0xFD0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>JEP106CON</name>
                <description>JEP106 continuation code</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>STMicroelectronics JEDEC code</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SIZE</name>
                <description>register file size</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The register file occupies a single 4-Kbyte region.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR0</name>
            <displayName>DBGMCU_PIDR0</displayName>
            <description>DBGMCU CoreSight peripheral identity register 0</description>
            <addressOffset>0xFE0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PARTNUM</name>
                <description>part number bits [7:0]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x00</name>
                    <description>DBGMCU part number</description>
                    <value>0x00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR1</name>
            <displayName>DBGMCU_PIDR1</displayName>
            <description>DBGMCU CoreSight peripheral identity register 1</description>
            <addressOffset>0xFE4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PARTNUM</name>
                <description>part number bits [11:8]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>DBGMCU part number</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>JEP106ID</name>
                <description>JEP106 identity code bits [3:0]</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>STMicroelectronics JEDEC code</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR2</name>
            <displayName>DBGMCU_PIDR2</displayName>
            <description>DBGMCU CoreSight peripheral identity register 2</description>
            <addressOffset>0xFE8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000000A</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>JEP106ID</name>
                <description>JEP106 identity code bits [6:4]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>STMicroelectronics JEDEC code</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>JEDEC</name>
                <description>JEDEC assigned value</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>designer identification specified by JEDEC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REVISION</name>
                <description>component revision number</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>r0p0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR3</name>
            <displayName>DBGMCU_PIDR3</displayName>
            <description>DBGMCU CoreSight peripheral identity register 3</description>
            <addressOffset>0xFEC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CMOD</name>
                <description>customer modified</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no customer modifications</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REVAND</name>
                <description>metal fix version</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no metal fix</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR0</name>
            <displayName>DBGMCU_CIDR0</displayName>
            <description>DBGMCU CoreSight component identity register 0</description>
            <addressOffset>0xFF0</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000000D</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>component identification bits [7:0]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0D</name>
                    <description>common identification value</description>
                    <value>0x0D</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR1</name>
            <displayName>DBGMCU_CIDR1</displayName>
            <description>DBGMCU CoreSight component identity register 1</description>
            <addressOffset>0xFF4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000F0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>component identification bits [11:8]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>common identification value</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLASS</name>
                <description>component identification bits [15:12]component class</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>Non-CoreSight component</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR2</name>
            <displayName>DBGMCU_CIDR2</displayName>
            <description>DBGMCU CoreSight component identity register 2</description>
            <addressOffset>0xFF8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000005</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>component identification bits [23:16]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x05</name>
                    <description>common identification value</description>
                    <value>0x05</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR3</name>
            <displayName>DBGMCU_CIDR3</displayName>
            <description>DBGMCU CoreSight component identity register 3</description>
            <addressOffset>0xFFC</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B1</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>component identification bits [31:24]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB1</name>
                    <description>common identification value</description>
                    <value>0xB1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
