sa3mv3g/jerry/tools/ozone/STM32H563.svd
          <register>
            <name>DCMI_ESUR</name>
            <displayName>DCMI_ESUR</displayName>
            <description>DCMI embedded synchronization unmask register </description>
            <addressOffset>0x1c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FSU</name>
                <description>Frame start delimiter unmask
This byte specifies the mask to be applied to the code of the frame start delimiter.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The corresponding bit in the FSC byte in DCMI_ESCR is masked while comparing the frame start delimiter with the received data.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The corresponding bit in the FSC byte in DCMI_ESCR is compared while comparing the frame start delimiter with the received data.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSU</name>
                <description>Line start delimiter unmask
This byte specifies the mask to be applied to the code of the line start delimiter.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The corresponding bit in the LSC byte in DCMI_ESCR is masked while comparing the line start delimiter with the received data.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The corresponding bit in the LSC byte in DCMI_ESCR is compared while comparing the line start delimiter with the received data.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LEU</name>
                <description>Line end delimiter unmask
This byte specifies the mask to be applied to the code of the line end delimiter.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The corresponding bit in the LEC byte in DCMI_ESCR is masked while comparing the line end delimiter with the received data.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The corresponding bit in the LEC byte in DCMI_ESCR is compared while comparing the line end delimiter with the received data.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FEU</name>
                <description>Frame end delimiter unmask
This byte specifies the mask to be applied to the code of the frame end delimiter.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The corresponding bit in the FEC byte in DCMI_ESCR is masked while comparing the frame end delimiter with the received data.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The corresponding bit in the FEC byte in DCMI_ESCR is compared while comparing the frame end delimiter with the received data.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DCMI_CWSTRT</name>
            <displayName>DCMI_CWSTRT</displayName>
            <description>DCMI crop window start </description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HOFFCNT</name>
                <description>Horizontal offset count
This value gives the number of pixel clocks to count before starting a capture.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>14</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>VST</name>
                <description>Vertical start line count
The image capture starts with this line number. Previous line data are ignored.
....</description>
                <bitOffset>16</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>line 1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>line 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>line 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DCMI_CWSIZE</name>
            <displayName>DCMI_CWSIZE</displayName>
            <description>DCMI crop window size </description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CAPCNT</name>
                <description>Capture count
This value gives the number of pixel clocks to be captured from the starting point on the same line. It value must corresponds to word-aligned data for different widths of parallel interfaces.
0x0000 =  1 pixel
0x0001 =  2 pixels
0x0002 =  3 pixels
....</description>
                <bitOffset>0</bitOffset>
                <bitWidth>14</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>VLINE</name>
                <description>Vertical line count
This value gives the number of lines to be captured from the starting point.
....</description>
                <bitOffset>16</bitOffset>
                <bitWidth>14</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>1 line</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>2 lines</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>3 lines</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DCMI_DR</name>
            <displayName>DCMI_DR</displayName>
            <description>DCMI data register </description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BYTE0</name>
                <description>Data byte 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>BYTE1</name>
                <description>Data byte 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>BYTE2</name>
                <description>Data byte 2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>BYTE3</name>
                <description>Data byte 3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
