sa3mv3g/jerry/tools/ozone/STM32H563.svd
          <register>
            <name>ETH_MMC_RX_INTERRUPT</name>
            <displayName>ETH_MMC_RX_INTERRUPT</displayName>
            <description>MMC Rx interrupt register</description>
            <addressOffset>0x0704</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RXCRCERPIS</name>
                <description>MMC Receive CRC Error Packet Counter Interrupt Status
This bit is set when the Rx CRC error packets register (ETH_RX_CRC_ERROR_PACKETS) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <readAction>clear</readAction>
              </field>
              <field>
                <name>RXALGNERPIS</name>
                <description>MMC Receive Alignment Error Packet Counter Interrupt Status
This bit is set when the Rx alignment error packets register (ETH_RX_ALIGNMENT_ERROR_PACKETS) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <readAction>clear</readAction>
              </field>
              <field>
                <name>RXUCGPIS</name>
                <description>MMC Receive Unicast Good Packet Counter Interrupt Status
This bit is set when the Rx unicast packets good register (ETH_RX_UNICAST_PACKETS_GOOD) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <readAction>clear</readAction>
              </field>
              <field>
                <name>RXLPIUSCIS</name>
                <description>MMC Receive LPI microsecond counter interrupt status
This bit is set when the Rx LPI microsecond counter register (ETH_RX_LPI_USEC_CNTR) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <readAction>clear</readAction>
              </field>
              <field>
                <name>RXLPITRCIS</name>
                <description>MMC Receive LPI transition counter interrupt status
This bit is set when the Rx LPI transition counter register (ETH_RX_LPI_TRAN_CNTR) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <readAction>clear</readAction>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_MMC_TX_INTERRUPT</name>
            <displayName>ETH_MMC_TX_INTERRUPT</displayName>
            <description>MMC Tx interrupt register</description>
            <addressOffset>0x0708</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TXSCOLGPIS</name>
                <description>MMC Transmit Single Collision Good Packet Counter Interrupt Status
This bit is set when the Tx single collision good packets register (ETH_TX_SINGLE_COLLISION_GOOD_PACKETS) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <readAction>clear</readAction>
              </field>
              <field>
                <name>TXMCOLGPIS</name>
                <description>MMC Transmit Multiple Collision Good Packet Counter Interrupt Status
This bit is set when the Tx multiple collision good packets register (ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <readAction>clear</readAction>
              </field>
              <field>
                <name>TXGPKTIS</name>
                <description>MMC Transmit Good Packet Counter Interrupt Status
This bit is set when the Tx packet count good register (ETH_TX_PACKET_COUNT_GOOD) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <readAction>clear</readAction>
              </field>
              <field>
                <name>TXLPIUSCIS</name>
                <description>MMC Transmit LPI microsecond counter interrupt status
This bit is set when the Tx LPI microsecond timer register (ETH_TX_LPI_USEC_CNTR) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <readAction>clear</readAction>
              </field>
              <field>
                <name>TXLPITRCIS</name>
                <description>MMC Transmit LPI transition counter interrupt status
This bit is set when the Tx LPI transition counter register (ETH_TX_LPI_TRAN_CNTR) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <readAction>clear</readAction>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_MMC_RX_INTERRUPT_MASK</name>
            <displayName>ETH_MMC_RX_INTERRUPT_MASK</displayName>
            <description>MMC Rx interrupt mask register</description>
            <addressOffset>0x070C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RXCRCERPIM</name>
                <description>MMC Receive CRC Error Packet Counter Interrupt Mask
Setting this bit masks the interrupt when the Rx CRC error packets register (ETH_RX_CRC_ERROR_PACKETS) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXALGNERPIM</name>
                <description>MMC Receive Alignment Error Packet Counter Interrupt Mask
Setting this bit masks the interrupt when the Rx alignment error packets register (ETH_RX_ALIGNMENT_ERROR_PACKETS) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXUCGPIM</name>
                <description>MMC Receive Unicast Good Packet Counter Interrupt Mask
Setting this bit masks the interrupt when the Rx unicast packets good register (ETH_RX_UNICAST_PACKETS_GOOD) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXLPIUSCIM</name>
                <description>MMC Receive LPI microsecond counter interrupt Mask
Setting this bit masks the interrupt when the Rx LPI microsecond counter register (ETH_RX_LPI_USEC_CNTR) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXLPITRCIM</name>
                <description>MMC Receive LPI transition counter interrupt Mask
Setting this bit masks the interrupt when the Rx LPI transition counter register (ETH_RX_LPI_TRAN_CNTR) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_MMC_TX_INTERRUPT_MASK</name>
            <displayName>ETH_MMC_TX_INTERRUPT_MASK</displayName>
            <description>MMC Tx interrupt mask register</description>
            <addressOffset>0x0710</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TXSCOLGPIM</name>
                <description>MMC Transmit Single Collision Good Packet Counter Interrupt Mask
Setting this bit masks the interrupt when the Tx single collision good packets register (ETH_TX_SINGLE_COLLISION_GOOD_PACKETS) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXMCOLGPIM</name>
                <description>MMC Transmit Multiple Collision Good Packet Counter Interrupt Mask
Setting this bit masks the interrupt when the Tx multiple collision good packets register (ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXGPKTIM</name>
                <description>MMC Transmit Good Packet Counter Interrupt Mask
Setting this bit masks the interrupt when the Tx packet count good register (ETH_TX_PACKET_COUNT_GOOD) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXLPIUSCIM</name>
                <description>MMC Transmit LPI microsecond counter interrupt Mask
Setting this bit masks the interrupt when the Tx LPI microsecond timer register (ETH_TX_LPI_USEC_CNTR) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXLPITRCIM</name>
                <description>MMC Transmit LPI transition counter interrupt Mask
Setting this bit masks the interrupt when the Tx LPI transition counter register (ETH_TX_LPI_TRAN_CNTR) counter reaches half of the maximum value or the maximum value.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_TX_SINGLE_COLLISION_GOOD_PACKETS</name>
            <displayName>ETH_TX_SINGLE_COLLISION_GOOD_PACKETS</displayName>
            <description>Tx single collision good packets register</description>
            <addressOffset>0x074C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TXSNGLCOLG</name>
                <description>Tx Single Collision Good Packets
This field indicates the number of successfully transmitted packets after a single collision in the Half-duplex mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS</name>
            <displayName>ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS</displayName>
            <description>Tx multiple collision good packets register</description>
            <addressOffset>0x0750</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TXMULTCOLG</name>
                <description>Tx Multiple Collision Good Packets
This field indicates the number of successfully transmitted packets after multiple collisions in the Half-duplex mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_TX_PACKET_COUNT_GOOD</name>
            <displayName>ETH_TX_PACKET_COUNT_GOOD</displayName>
            <description>Tx packet count good register</description>
            <addressOffset>0x0768</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TXPKTG</name>
                <description>Tx Packet Count Good
This field indicates the number of good packets transmitted.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_RX_CRC_ERROR_PACKETS</name>
            <displayName>ETH_RX_CRC_ERROR_PACKETS</displayName>
            <description>Rx CRC error packets register</description>
            <addressOffset>0x0794</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RXCRCERR</name>
                <description>Rx CRC Error Packets
This field indicates the number of packets received with CRC error.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_RX_ALIGNMENT_ERROR_PACKETS</name>
            <displayName>ETH_RX_ALIGNMENT_ERROR_PACKETS</displayName>
            <description>Rx alignment error packets register</description>
            <addressOffset>0x0798</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RXALGNERR</name>
                <description>Rx Alignment Error Packets
This field indicates the number of packets received with alignment (dribble) error. It is valid only in 10/100 mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_RX_UNICAST_PACKETS_GOOD</name>
            <displayName>ETH_RX_UNICAST_PACKETS_GOOD</displayName>
            <description>Rx unicast packets good register</description>
            <addressOffset>0x07C4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RXUCASTG</name>
                <description>Rx Unicast Packets Good
This field indicates the number of good unicast packets received.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_TX_LPI_USEC_CNTR</name>
            <displayName>ETH_TX_LPI_USEC_CNTR</displayName>
            <description>Tx LPI microsecond timer register</description>
            <addressOffset>0x07EC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TXLPIUSC</name>
                <description>Tx LPI Microseconds Counter
This field indicates the number of microseconds Tx LPI is asserted. For every Tx LPI Entry and Exit, the Timer value can have an error of +/- 1 microsecond.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_TX_LPI_TRAN_CNTR</name>
            <displayName>ETH_TX_LPI_TRAN_CNTR</displayName>
            <description>Tx LPI transition counter register</description>
            <addressOffset>0x07F0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TXLPITRC</name>
                <description>Tx LPI Transition counter
This field indicates the number of times Tx LPI Entry has occurred. Even if Tx LPI Entry occurs in Automate mode (because of LPITXA bit set in the LPI control and status register (ETH_MACLCSR)), the counter is incremented.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_RX_LPI_USEC_CNTR</name>
            <displayName>ETH_RX_LPI_USEC_CNTR</displayName>
            <description>Rx LPI microsecond counter register</description>
            <addressOffset>0x07F4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RXLPIUSC</name>
                <description>Rx LPI Microseconds Counter
This field indicates the number of microseconds Rx LPI is asserted. For every Rx LPI Entry and Exit, the Timer value can have an error of +/- 1 microsecond.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ETH_RX_LPI_TRAN_CNTR</name>
            <displayName>ETH_RX_LPI_TRAN_CNTR</displayName>
            <description>Rx LPI transition counter register</description>
            <addressOffset>0x07F8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RXLPITRC</name>
                <description>Rx LPI Transition counter
This field indicates the number of times Rx LPI Entry has occurred.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
