sa3mv3g/jerry/tools/ozone/STM32H563.svd
          <register>
            <name>FLASH_SECBB1R1</name>
            <displayName>FLASH_SECBB1R1</displayName>
            <description>FLASH secure block based register for Bank 1</description>
            <addressOffset>0xA0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SECBB1</name>
                <description>Secure/non-secure 8Kbytes flash Bank 1 sector attributes</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is non secure.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is secure.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_SECBB1R2</name>
            <displayName>FLASH_SECBB1R2</displayName>
            <description>FLASH secure block based register for Bank 1</description>
            <addressOffset>0xA4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SECBB1</name>
                <description>Secure/non-secure 8Kbytes flash Bank 1 sector attributes</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is non secure.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is secure.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_SECBB1R3</name>
            <displayName>FLASH_SECBB1R3</displayName>
            <description>FLASH secure block based register for Bank 1</description>
            <addressOffset>0xA8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SECBB1</name>
                <description>Secure/non-secure 8Kbytes flash Bank 1 sector attributes</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is non secure.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is secure.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_SECBB1R4</name>
            <displayName>FLASH_SECBB1R4</displayName>
            <description>FLASH secure block based register for Bank 1</description>
            <addressOffset>0xAC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SECBB1</name>
                <description>Secure/non-secure 8Kbytes flash Bank 1 sector attributes</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is non secure.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is secure.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_PRIVBB1R1</name>
            <displayName>FLASH_PRIVBB1R1</displayName>
            <description>FLASH privilege block based register for Bank 1</description>
            <addressOffset>0xC0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIVBB1</name>
                <description>Privileged/unprivileged 8-Kbyte flash Bank 1 sector attribute</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>sectors (32 * (x-1) + y) in bank 1 is unprivileged.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is privileged.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_PRIVBB1R2</name>
            <displayName>FLASH_PRIVBB1R2</displayName>
            <description>FLASH privilege block based register for Bank 1</description>
            <addressOffset>0xC4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIVBB1</name>
                <description>Privileged/unprivileged 8-Kbyte flash Bank 1 sector attribute</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>sectors (32 * (x-1) + y) in bank 1 is unprivileged.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is privileged.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_PRIVBB1R3</name>
            <displayName>FLASH_PRIVBB1R3</displayName>
            <description>FLASH privilege block based register for Bank 1</description>
            <addressOffset>0xC8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIVBB1</name>
                <description>Privileged/unprivileged 8-Kbyte flash Bank 1 sector attribute</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>sectors (32 * (x-1) + y) in bank 1 is unprivileged.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is privileged.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_PRIVBB1R4</name>
            <displayName>FLASH_PRIVBB1R4</displayName>
            <description>FLASH privilege block based register for Bank 1</description>
            <addressOffset>0xCC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIVBB1</name>
                <description>Privileged/unprivileged 8-Kbyte flash Bank 1 sector attribute</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>sectors (32 * (x-1) + y) in bank 1 is unprivileged.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>sector (32 * (x-1) + y) in bank 1 is privileged.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_SECWM1R_CUR</name>
            <displayName>FLASH_SECWM1R_CUR</displayName>
            <description>FLASH security watermark for Bank 1</description>
            <addressOffset>0x0E0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFF00FF00</resetMask>
            <fields>
              <field>
                <name>SECWM1_STRT</name>
                <description>Bank1 security WM area 1 start sector</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SECWM1_END</name>
                <description>Bank1 security WM area 1 end sector</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_SECWM1R_PRG</name>
            <displayName>FLASH_SECWM1R_PRG</displayName>
            <description>FLASH security watermark for Bank 1</description>
            <addressOffset>0x0E4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFF00FF00</resetMask>
            <fields>
              <field>
                <name>SECWM1_STRT</name>
                <description>Bank1 security WM area 1 start sector</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SECWM1_END</name>
                <description>Bank1 security WM area 1 end sector</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WRP1R_CUR</name>
            <displayName>FLASH_WRP1R_CUR</displayName>
            <description>FLASH write sector group protection for Bank 1</description>
            <addressOffset>0x0E8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>WRPSG1</name>
                <description>Bank 1 sector group protection option status byte
Each FLASH_WRP1R_CUR bit reflects the write protection status of the corresponding group of four consecutive sectors in bank 1 (0: the group is write protected; 1: the group is not write protected)
Bit 0: Group embedding sectors 0 to 3
Bit 1: Group embedding sectors 4 to 7
Bit N: Group embedding sectors 4 x N to 4 x N + 3
Bit 31: Group embedding sectors 124 to 127</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WRP1R_PRG</name>
            <displayName>FLASH_WRP1R_PRG</displayName>
            <description>FLASH write sector group protection for Bank 1</description>
            <addressOffset>0x0EC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>WRPSG1</name>
                <description>Bank1 sector group protection option status byte
Setting WRPSG1 bits to 0 write protects the corresponding group of four consecutive sectors in bank 1 (0: the group is write protected; 1: the group is not write protected)
Bit 0: Group embedding sectors 0 to 3
Bit 1: Group embedding sectors 4 to 7
Bit N: Group embedding sectors 4 x N to 4 x N + 3
Bit 31: Group embedding sectors 124 to 127</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_EDATA1R_CUR</name>
            <displayName>FLASH_EDATA1R_CUR</displayName>
            <description>FLASH data sector configuration Bank 1</description>
            <addressOffset>0x0F0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>EDATA1_STRT</name>
                <description>EDATA1_STRT contains the start sectors of the flash high-cycle data area in Bank1 There is no hardware effect to those bits. They shall be managed by ST tools in Flasher.
...</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The last sector of the Bank1 is reserved for flash high-cycle data</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The two last sectors of the Bank 1 are reserved for flash high-cycle data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>The three last sectors of the Bank 1 are reserved for flash high-cycle data</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>The eight last sectors of the Bank 1 are reserved for flash high-cycle data</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EDATA1_EN</name>
                <description>Bank1 flash high-cycle data enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No flash high-cycle data area</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Flash high-cycle data is used</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_EDATA1R_PRG</name>
            <displayName>FLASH_EDATA1R_PRG</displayName>
            <description>FLASH data sector configuration Bank 1</description>
            <addressOffset>0xF4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>EDATA1_STRT</name>
                <description>EDATA1_STRT contains the start sectors of the flash high-cycle data area in Bank 1 There is no hardware effect to those bits. They shall be managed by ST tools in Flasher.
...
Note: 111: The eight last sectors of the Bank 1 are reserved for flash high-cycle data</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The last sector of the Bank 1 is reserved for flash high-cycle data</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The two last sectors of the Bank 1 are reserved for flash high-cycle data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>The three last sectors of the Bank 1 are reserved for flash high-cycle data</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EDATA1_EN</name>
                <description>Bank 1 flash high-cycle data enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No flash high-cycle data area</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Flash high-cycle data is used</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_HDP1R_CUR</name>
            <displayName>FLASH_HDP1R_CUR</displayName>
            <description>FLASH HDP Bank 1 configuration</description>
            <addressOffset>0x0F8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDP1_STRT</name>
                <description>HDPL barrier start set in number of 8-Kbyte sectors</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>HDP1_END</name>
                <description>HDPL barrier end set in number of 8-Kbyte sectors</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_HDP1R_PRG</name>
            <displayName>FLASH_HDP1R_PRG</displayName>
            <description>FLASH HDP Bank 1 configuration</description>
            <addressOffset>0x0FC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDP1_STRT</name>
                <description>HDPL barrier start set in number of 8-Kbyte sectors</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HDP1_END</name>
                <description>HDPL barrier end set in number of 8-Kbyte sectors</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
