sa3mv3g/jerry/tools/ozone/STM32H563.svd
          <register>
            <name>FLASH_EDATA2R_CUR</name>
            <displayName>FLASH_EDATA2R_CUR</displayName>
            <description>FLASH data sectors configuration Bank 2</description>
            <addressOffset>0x1F0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>EDATA2_STRT</name>
                <description>EDATA2_STRT contains the start sectors of the flash high-cycle data area in Bank 2 There is no hardware effect to those bits. They shall be managed by ST tools in Flasher.
...
Note: 111: The eight last sectors of the Bank 2 are reserved for flash high-cycle data</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The last sector of the bank 2is reserved for flash high-cycle data</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The two last sectors of the Bank 2 are reserved for flash high-cycle data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>The three last sectors of the Bank 2 are reserved for flash high-cycle data</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EDATA2_EN</name>
                <description>Bank2 flash high-cycle data enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No flash high-cycle data area</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Flash high-cycle data is used</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_EDATA2R_PRG</name>
            <displayName>FLASH_EDATA2R_PRG</displayName>
            <description>FLASH data sector configuration Bank 2</description>
            <addressOffset>0x1F4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>EDATA2_STRT</name>
                <description>EDATA2_STRT contains the start sectors of the flash high-cycle data area in Bank 2 There is no hardware effect to those bits. They shall be managed by ST tools in Flasher.
...
Note: 111: The eight last sectors of the Bank 2 are reserved for flash high-cycle data.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The last sector of the Bank 2 is reserved for flash high-cycle data.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The two last sectors of the Bank 2 are reserved for flash high-cycle data.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>The three last sectors of the Bank 2 are reserved for flash high-cycle data.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EDATA2_EN</name>
                <description>Bank 2 flash high-cycle data enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No flash high-cycle data area</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Flash high-cycle data is used</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_HDP2R_CUR</name>
            <displayName>FLASH_HDP2R_CUR</displayName>
            <description>FLASH HDP Bank 2 configuration</description>
            <addressOffset>0x1F8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDP2_STRT</name>
                <description>HDPL barrier start set in number of 8-Kbyte sectors</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>HDP2_END</name>
                <description>HDPL barrier end set in number of 8-Kbyte sectors</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_HDP2R_PRG</name>
            <displayName>FLASH_HDP2R_PRG</displayName>
            <description>FLASH HDP Bank 2 configuration</description>
            <addressOffset>0x1FC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDP2_STRT</name>
                <description>HDPL barrier start set in number of 8-Kbyte sectors</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HDP2_END</name>
                <description>HDPL barrier end set in number of 8-Kbyte sectors</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
