sa3mv3g/jerry/tools/ozone/STM32H563.svd
                    <name>B_0x0</name>
                    <description>I/O speed optimization disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O speed optimization enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>GPIOI_SECCFGR</name>
            <displayName>GPIOI_SECCFGR</displayName>
            <description>GPIO secure configuration register</description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000FFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SEC0</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC1</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC2</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC3</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC4</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC5</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC6</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC7</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC8</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC9</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC10</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC11</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC12</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC13</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC14</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEC15</name>
                <description>I/O pin of Port x secure bit enable y (y = 15 to 0)
These bits are written by software to enable or disable the I/O port pin security.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The I/O pin is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The I/O pin is secure. Refer to Table 94 for all corresponding secured bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
