sa3mv3g/jerry/tools/ozone/STM32H563.svd
          <register>
            <name>HASH_SR</name>
            <displayName>HASH_SR</displayName>
			<description>HASH status register </description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <resetValue>0x00110001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DINIS</name>
                <description>Data input interrupt status
This bit is set by hardware when the FIFO is ready to get a new block (16 locations are free). It is cleared by writing it to 0 or by writing the HASH_DIN register.
When DINIS = 0, HASH_CSRx registers reads as zero.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Less than 16 locations are free in the input buffer</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>A new block can be entered into the input buffer. An interrupt is generated if the DINIE bit is set in the HASH_IMR register.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCIS</name>
                <description>Digest calculation completion interrupt status
This bit is set by hardware when a digest becomes ready (the whole message has been processed). It is cleared by writing it to 0 or by writing the INIT bit to 1 in the HASH_CR register.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No digest available in the HASH_HRx registers (zeros are returned)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Digest calculation complete, a digest is available in the HASH_HRx registers. An interrupt is generated if the DCIE bit is set in the HASH_IMR register.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMAS</name>
                <description>DMA Status
This bit provides information on the DMA interface activity. It is set with DMAE and cleared when DMAE = 0 and no DMA transfer is ongoing. No interrupt is associated with this bit.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>DMA interface is disabled (DMAE = 0) and no transfer is ongoing</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>DMA interface is enabled (DMAE = 1) or a transfer is ongoing</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BUSY</name>
                <description>Busy bit</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No block is currently being processed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The hash core is processing a block of data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NBWP</name>
                <description>Number of words already pushed
This bitfield is the exact number of words in the message that have already been pushed into the FIFO. NBWP is incremented by 1 when a write access is performed to the HASH_DIN register.
When a digest calculation starts, NBWP is updated to NBWP- block size (in words), and NBWP goes to zero when the INIT bit is written to 1.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DINNE</name>
                <description>DIN not empty
This bit is set when the HASH_DIN register holds valid data (that is after being written at least once). It is cleared when either the INIT bit (initialization) or the DCAL bit (completion of the previous message processing) is written to 1.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No data are present in the data input buffer</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The input buffer contains at least one word of data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NBWE</name>
                <description>Number of words expected
This bitfield reflects the number of words in the message that must be pushed into the FIFO to trigger a partial computation. NBWE is decremented by 1 when a write access is performed to the HASH_DIN register.
NBWE is set to the expected block size +1 in words (0x11) when INIT bit is set in HASH_CR. It is set to the expected block size (0x10) when the partial digest calculation ends.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR0</name>
            <displayName>HASH_CSR0</displayName>
            <description>HASH context swap register 0</description>
            <addressOffset>0xf8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 0
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR1</name>
            <displayName>HASH_CSR1</displayName>
            <description>HASH context swap register 1</description>
            <addressOffset>0xfc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 1
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR2</name>
            <displayName>HASH_CSR2</displayName>
            <description>HASH context swap register 2</description>
            <addressOffset>0x100</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 2
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR3</name>
            <displayName>HASH_CSR3</displayName>
            <description>HASH context swap register 3</description>
            <addressOffset>0x104</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 3
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR4</name>
            <displayName>HASH_CSR4</displayName>
            <description>HASH context swap register 4</description>
            <addressOffset>0x108</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 4
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR5</name>
            <displayName>HASH_CSR5</displayName>
            <description>HASH context swap register 5</description>
            <addressOffset>0x10c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 5
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR6</name>
            <displayName>HASH_CSR6</displayName>
            <description>HASH context swap register 6</description>
            <addressOffset>0x110</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 6
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR7</name>
            <displayName>HASH_CSR7</displayName>
            <description>HASH context swap register 7</description>
            <addressOffset>0x114</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 7
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR8</name>
            <displayName>HASH_CSR8</displayName>
            <description>HASH context swap register 8</description>
            <addressOffset>0x118</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 8
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR9</name>
            <displayName>HASH_CSR9</displayName>
            <description>HASH context swap register 9</description>
            <addressOffset>0x11c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 9
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR10</name>
            <displayName>HASH_CSR10</displayName>
            <description>HASH context swap register 10</description>
            <addressOffset>0x120</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 10
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR11</name>
            <displayName>HASH_CSR11</displayName>
            <description>HASH context swap register 11</description>
            <addressOffset>0x124</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 11
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR12</name>
            <displayName>HASH_CSR12</displayName>
            <description>HASH context swap register 12</description>
            <addressOffset>0x128</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 12
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR13</name>
            <displayName>HASH_CSR13</displayName>
            <description>HASH context swap register 13</description>
            <addressOffset>0x12c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 13
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR14</name>
            <displayName>HASH_CSR14</displayName>
            <description>HASH context swap register 14</description>
            <addressOffset>0x130</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 14
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR15</name>
            <displayName>HASH_CSR15</displayName>
            <description>HASH context swap register 15</description>
            <addressOffset>0x134</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 15
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR16</name>
            <displayName>HASH_CSR16</displayName>
            <description>HASH context swap register 16</description>
            <addressOffset>0x138</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 16
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR17</name>
            <displayName>HASH_CSR17</displayName>
            <description>HASH context swap register 17</description>
            <addressOffset>0x13c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 17
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR18</name>
            <displayName>HASH_CSR18</displayName>
            <description>HASH context swap register 18</description>
            <addressOffset>0x140</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 18
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR19</name>
            <displayName>HASH_CSR19</displayName>
            <description>HASH context swap register 19</description>
            <addressOffset>0x144</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 19
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR20</name>
            <displayName>HASH_CSR20</displayName>
            <description>HASH context swap register 20</description>
            <addressOffset>0x148</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 20
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR21</name>
            <displayName>HASH_CSR21</displayName>
            <description>HASH context swap register 21</description>
            <addressOffset>0x14c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 21
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR22</name>
            <displayName>HASH_CSR22</displayName>
            <description>HASH context swap register 22</description>
            <addressOffset>0x150</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 22
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR23</name>
            <displayName>HASH_CSR23</displayName>
            <description>HASH context swap register 23</description>
            <addressOffset>0x154</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 23
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
