sa3mv3g/jerry/tools/ozone/STM32H563.svd
          <register>
            <name>I3C_EVR</name>
            <displayName>I3C_EVR</displayName>
            <description>I3C event register </description>
            <addressOffset>0x50</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000003</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CFEF</name>
                <description>C-FIFO empty flag (whatever the I3C is acting as controller/target)
This flag is asserted by hardware to indicate that the C-FIFO is empty when controller, and that the I3C_CR register contains no control word (i.e. none IBI/CR/HJ request) when target.
This flag is de-asserted by hardware to indicate that the C-FIFO is not empty when controller, and that the I3C_CR register contains one control word (i.e. a pending IBI/CR/HJ request) when target.
Note: When the I3C is acting as controller, if the C-FIFO and TX-FIFO preload is configured (i.e. I3C_CFGR.TMODE=1), the software must wait for TXFEF=1 and CFEF=1 before starting a new frame transfer.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TXFEF</name>
                <description>TX-FIFO empty flag (whatever the I3C is acting as controller/target)
This flag is asserted by hardware to indicate that the TX-FIFO is empty.
This flag is de-asserted by hardware to indicate that the TX-FIFO is not empty.
Note: When the I3C is acting as controller, if the C-FIFO and TX-FIFO preload is configured (i.e. I3C_CFGR.TMODE=1), the software must wait for TXFEF=1 and CFEF=1 before starting a new frame transfer.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFNFF</name>
                <description>C-FIFO not full flag (when the I3C is acting as controller)
When the I3C is acting as controller, this flag is asserted by hardware to indicate that a control word is to be written to the C-FIFO.
This flag is de-asserted by hardware to indicate that a control word is not to be written to the C-FIFO.
Note: The software must wait for CFNFF=1 (by polling or via the enabled interrupt) before writing to C-FIFO (i.e. writing to I3C_CR).</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SFNEF</name>
                <description>S-FIFO not empty flag (when the I3C is acting as controller)
When the I3C is acting as controller, if the S-FIFO is enabled (i.e. I3C_CFGR.RMODE=1), this flag is asserted by hardware to indicate that a status word is to be read from the S-FIFO.
This flag is de-asserted by hardware to indicate that a status word is not to be read from the S-FIFO.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TXFNFF</name>
                <description>TX-FIFO not full flag (whatever the I3C is acting as controller/target)
This flag is asserted by hardware to indicate that a data byte/word is to be written to the TX-FIFO.
This flag is de-asserted by hardware to indicate that a data byte/word is not to be written to the TX-FIFO.
Note: The software must wait for TXFNFF=1 (by polling or via the enabled interrupt) before writing to TX-FIFO (i.e. writing to I3C_TDR or I3C_TDWR depending on I3C_CFGR.TXTHRES).
Note: When the I3C is acting as target, if the software intends to use the TXFNFF flag for writing into I3C_TDR/I3C_TDWR, it must have configured and set the TX-FIFO preload (i.e. write I3C_TGTTDR.PRELOAD).</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RXFNEF</name>
                <description>RX-FIFO not empty flag (whatever the I3C is acting as controller/target)
This flag is asserted by hardware to indicate that a data byte is to be read from the RX-FIFO.
This flag is de-asserted by hardware to indicate that a data byte is not to be read from the RX-FIFO.
Note: The software must wait for RXFNEF=1 (by polling or via the enabled interrupt) before reading from RX-FIFO (i.e. writing to I3C_RDR or I3C_RDWR depending on I3C_CFGR.RXTHRES).</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TXLASTF</name>
                <description>last written data byte/word flag (whatever the I3C is acting as controller/target)
This flag is asserted by hardware to indicate that the last data byte/word (depending on I3C_CFGR.TXTHRES) of a message is to be written to the TX-FIFO.
This flag is de-asserted by hardware when the last data byte/word of a message is written.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RXLASTF</name>
                <description>last read data byte/word flag (whatever the I3C is acting as controller/target)
This flag is asserted by hardware to indicate that the last data byte/word (depending on I3C_CFGR.RXTHRES) of a message is to be read from the RX-FIFO.
This flag is de-asserted by hardware when the last data byte/word of a message is read.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>FCF</name>
                <description>frame complete flag (whatever the I3C is acting as controller/target)
When the I3C is acting as controller, this flag is asserted by hardware to indicate that a frame has been (normally) completed on the I3C bus, i.e when a stop is issued.
When the I3C is acting as target, this flag is asserted by hardware to indicate that a message addressed to/by this target has been (normally) completed on the I3C bus, i.e when a next stop or repeated start is then issued by the controller.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CFCF bit.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RXTGTENDF</name>
                <description>target-initiated read end flag (when the I3C is acting as controller)
When the I3C is acting as controller, this flag is asserted by hardware to indicate that the target has prematurely ended a read transfer.
Then, software should read I3C_SR to get more information on the prematurely read transfer.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CRXTGTENDF bit.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRF</name>
                <description>flag (whatever the I3C is acting as controller/target)
This flag is asserted by hardware to indicate that an error occurred.Then, software should read I3C_SER to get the error type.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CERRF bit.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IBIF</name>
                <description>IBI flag (when the I3C is acting as controller)
When the I3C is acting as controller, this flag is asserted by hardware to indicate that an IBI request has been received.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CIBIF bit.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IBIENDF</name>
                <description>IBI end flag (when the I3C is acting as target)
When the I3C is acting as target, this flag is asserted by hardware to indicate that a IBI transfer has been received and completed (IBI acknowledged and IBI data bytes read by controller if any).
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CIBIENDF bit.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CRF</name>
                <description>controller-role request flag (when the I3C is acting as controller)
When the I3C is acting as controller, this flag is asserted by hardware to indicate that a controller-role request has been acknowledged and completed (by hardware). The software should then issue a GETACCCR CCC (get accept controller role) for the controller-role hand-off procedure.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CCRF bit.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CRUPDF</name>
                <description>controller-role update flag (when the I3C is acting as target)
When the I3C is acting as target, this flag is asserted by hardware to indicate that it has now gained the controller role after the completed controller-role hand-off procedure.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CCRUPDF bit.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>HJF</name>
                <description>hot-join flag (when the I3C is acting as controller)
When the I3C is acting as controller, this flag is asserted by hardware to indicate that an hot join request has been received.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CHJF bit.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>WKPF</name>
                <description>wakeup/missed start flag (when the I3C is acting as target)
When the I3C is acting as target, this flag is asserted by hardware to indicate that a start has been detected (i.e. a SDA falling edge followed by a SCL falling edge) but on the next SCL falling edge, the I3C kernel clock is (still) gated. Thus an I3C bus transaction may have been lost by the target.
The corresponding interrupt may be used to wakeup the device from a low power mode (Sleep or Stop mode).
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CWKPF bit.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>GETF</name>
                <description>get flag (when the I3C is acting as target)
When the I3C is acting as target, this flag is asserted by hardware to indicate that any direct CCC of get type (GET*** CCC) has been received.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CGETF bit.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>STAF</name>
                <description>get status flag (when the I3C is acting as target)
When the I3C is acting as target, this flag is asserted by hardware to indicate that a direct GETSTATUS CCC (get status) has been received.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CSTAF bit.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DAUPDF</name>
                <description>dynamic address update flag (when the I3C is acting as target)
When the I3C is acting as target, this flag is asserted by hardware to indicate that a dynamic address update has been received via any of the broadcast ENTDAA, RSTDAA and direct SETNEWDA CCC.
Then, software should read I3C_DEVR0.DA[6:0] to get the maximum write length value.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CDAUPDF bit.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MWLUPDF</name>
                <description>maximum write length update flag (when the I3C is acting as target)
When the I3C is acting as target, this flag is asserted by hardware to indicate that a direct SETMWL CCC (set max write length) has been received.
Then, software should read I3C_MAXWLR.MWL[15:0] to get the maximum write length value.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CMWLUPDF bit.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MRLUPDF</name>
                <description>maximum read length update flag (when the I3C is acting as target)
When the I3C is acting as target, this flag is asserted by hardware to indicate that a direct SETMRL CCC (set max read length) has been received.
Then, software should read I3C_MAXRLR.MRL[15:0] to get the maximum read length value.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CMRLUPDF bit.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RSTF</name>
                <description>reset pattern flag (when the I3C is acting as target)
When the I3C is acting as target, this flag is asserted by hardware to indicate that a reset pattern has been detected (i.e. 14 SDA transitions while SCL is low, followed by repeated start, then stop).
Then, software should read I3C_DEVR0.RSTACT[1:0] and I3C_DEVR0.RSTVAL, to know what reset level is required.
If RSTVAL=1: when the RSTF is asserted (and/or the corresponding interrupt if enabled), I3C_DEVR0.RSTACT[1:0] dictates the reset action to be performed by the software if any.
If RSTVAL=0: when the RSTF is asserted (and/or the corresponding interrupt if enabled), the software should issue an I3C reset after a first detected reset pattern, and a system reset on the second one.
The corresponding interrupt may be used to wakeup the device from a low power mode (Sleep or Stop mode).
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CRSTF bit.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ASUPDF</name>
                <description>activity state update flag (when the I3C is acting as target)
When the I3C is acting as target, this flag is asserted by hardware to indicate that the direct or broadcast ENTASx CCC (with x=0...3) has been received.
Then, software should read I3C_DEVR0.AS[1:0].
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CASUPDF bit.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INTUPDF</name>
                <description>interrupt/controller-role/hot-join update flag (when the I3C is acting as target)
When the I3C is acting as target, this flag is asserted by hardware to indicate that the direct or broadcast ENEC/DISEC CCC (enable/disable target events) has been received, where a target event is either an interrupt/IBI request, a controller-role request, or an hot-join request.
Then, software should read respectively I3C_DEVR0.IBIEN, I3C_DEVR0.CREN or I3C_DEVR0.HJEN.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CINTUPDF bit.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DEFF</name>
                <description>DEFTGTS flag (when the I3C is acting as target)
When the I3C is acting as target (and is typically controller capable), this flag is asserted by hardware to indicate that the broadcast DEFTGTS CCC (define list of targets) has been received.
Then, software may store the received data for when getting the controller role.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CDEFF bit.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>GRPF</name>
                <description>group addressing flag (when the I3C is acting as target)
When the I3C is acting as target (and is typically controller capable), this flag is asserted by hardware to indicate that the broadcast DEFGRPA CCC (define list of group addresses) has been received.
Then, software may store the received data for when getting the controller role.
This flag is cleared when software writes 1 into corresponding I3C_CEVR.CGRPF bit.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
