sa3mv3g/jerry/tools/ozone/STM32H563.svd
          <register>
            <name>I3C_DEVR4</name>
            <displayName>I3C_DEVR4</displayName>
            <description>I3C device 4 characteristics register</description>
            <addressOffset>0x70</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DA</name>
                <description>assigned I3C dynamic address to target x (when the I3C is acting as controller)
When the I3C is acting as controller, this field should be written by software to store the 7-bit dynamic address that the controller sends via a broadcast ENTDAA or a direct SETNEWDA CCC which has been acknowledged by the target x.
Writing to this field has no impact when the read field I3C_DEVRx.DIS=1.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIACK</name>
                <description>IBI request acknowledge (when the I3C is acting as controller)
When the I3C is acting as controller, this bit is written by software to define the acknowledge policy to be applied on the I3C bus on the reception of a IBI request from target x:
- After the NACK, the message continues as initially programmed (the target is aware of the NACK and can emit another IBI request later on)
- The field DIS is asserted by hardware to protect DA[6:0] from being modified by software meanwhile the hardware can store internally the current DA[6:0] into the kernel clock domain.
- After the ACK, the controller logs the IBI payload data, if any, depending on I3C_DEVRx.IBIDEN.
- The software is notified by the IBI flag (i.e. I3C_EVR.IBIF=1) and/or the corresponding interrupt if enabled;
- Independently from IBIACK configuration for this or other devices, further IBI request(s) are NACKed until IBI request flag (i.e. I3C_EVR.IBIF) and controller-role request flag (i.e. I3C_EVR.CRF) are both cleared.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>an IBI request from target x is to be NACKed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>an IBI request (with 7-bit dynamic address DA[6:0]) from target x is to be ACKed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CRACK</name>
                <description>controller-role request acknowledge (when the I3C is acting as controller)
When the I3C is acting as controller, this bit is written by software to define the acknowledge policy to be applied on the I3C bus on the reception of a controller-role request from target x:
After the NACK, the message continues as initially programmed (the target is aware of the NACK and can emit another controller-role request later on)
- The field DIS is asserted by hardware to protect DA[6:0] from being modified by software meanwhile the hardware can store internally the current DA[6:0] into the kernel clock domain.
- After the ACK, the message continues as initially programmed. The software is notified by the controller-role request flag (i.e. I3C_EVR.CRF=1) and/or the corresponding interrupt if enabled; For effectively granting the controller-role to the requesting secondary controller, software should issue a GETACCCR (formerly known as GETACCMST), followed by a STOP.
- Independently of CRACK configuration for this or other devices, further controller-role request(s) are NACKed until controller-role request flag (i.e. I3C_EVR.CRF) and IBI flag (i.e. I3C_EVR.IBIF) are both cleared.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>a controller-role request from target x is to be NACKed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>a controller-role request (with 7-bit dynamic address DA[6:0]) from target x is to be ACKed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IBIDEN</name>
                <description>IBI data enable (when the I3C is acting as controller)
When the I3C is acting as controller, this bit should be written by software to store the BCR[2] bit as received from the target x during broadcast ENTDAA or direct GETBCR CCC via the received I3C_RDR.
Writing to this field has no impact when the read field I3C_DEVRx.DIS=1.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no data byte follows the acknowledged IBI from target x</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>the mandatory data byte MDB[7:0] follows the acknowledged IBI from target x</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SUSP</name>
                <description>suspend/stop I3C transfer on received IBI (when the I3C is acting as controller)
When the I3C is acting as controller, this bit is used to receive an IBI from target x with pending read notification feature (i.e. with received MDB[7:5]=3'b101).
If this bit is set, when an IBI is received (i.e. I3C_EVR.IBIF=1), a Stop is emitted on the I3C bus and the C-FIFO is automatically flushed by hardware; to avoid a next private read communication issue if a previous private read message to the target x was stored in the C-FIFO.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I3C transfer is not stopped and C-FIFO is not flushed </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I3C transfer is stopped and C-FIFO is flushed on a received IBI request from target x</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIS</name>
                <description>DA[6:0] write disabled (when the I3C is acting as controller)
When the I3C is acting as controller, once that software set IBIACK=1 or CRACK=1, this read bit is set by hardware (i.e. DIS=1) to lock the configured DA[6:0] and IBIDEN values.
Then, to be able to next modify DA[6:0] or IBIDEN, the software must wait for this field DIS to be de-asserted by hardware (i.e. polling on DIS=0) before modifying these two assigned values to the target x. Indeed, the target may be requesting an IBI or a controller-role meanwhile the controller intends to modify DA[6:0] or IBIDEN.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>write to I3C_DEVRx.DA[7:0] and to I3C_DEVRx.IBIDEN is allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>write I3C_DEVRx.DA[7:0] and to I3C_DEVRx.IBIDEN is disabled/locked </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_MAXRLR</name>
            <displayName>I3C_MAXRLR</displayName>
            <description>I3C maximum read length register </description>
            <addressOffset>0x90</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MRL</name>
                <description>maximum data read length (when I3C is acting as target)
This field is initially written by software when I3C_CFGR.EN=0 and updated by hardware on the reception of SETMRL command (with potentially also updated IBIP[2:0]).
Software is notified of a MRL update by the I3C_EVR.MRLUPF and the corresponding interrupt if enabled.
This field is used by hardware to return the value on the I3C bus when the target receives a GETMRL CCC.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIP</name>
                <description>IBI payload data size, in bytes (when I3C is acting as target)
This field is initially written by software when I3C_CFGR.EN=0 to set the number of data bytes to be sent to the controller after an IBI request has been acknowledged.This field may be updated by hardware on the reception of SETMRL command (which potentially also updated IBIP[2:0]).
Software is notified of a MRL update by the I3C_EVR.MRLUPF and the corresponding interrupt if enabled.
others: same as 100</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>null payload data size (only allowed when IC3_BCR.BCR2=0)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1 byte (i.e. mandatory data byte MDB[7:0]</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>2 bytes (including first MDB[7:0])</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>3 bytes (including first MDB[7:0])</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>4 bytes (including first MDB[7:0])</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_MAXWLR</name>
            <displayName>I3C_MAXWLR</displayName>
            <description>I3C maximum write length register </description>
            <addressOffset>0x94</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MWL</name>
                <description>maximum data write length (when I3C is acting as target)
This field is initially written by software when I3C_CFGR.EN=0 and updated by hardware on the reception of SETMWL command.
Software is notified of a MWL update by the I3C_EVR.MWLUPF and the corresponding interrupt if enabled.
This field is used by hardware to return the value on the I3C bus when the target receives a GETMWL CCC.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_TIMINGR0</name>
            <displayName>I3C_TIMINGR0</displayName>
            <description>I3C timing register 0 </description>
            <addressOffset>0xa0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SCLL_PP</name>
                <description>SCL low duration in I3C push-pull phases, in number of kernel clocks cycles:
tSCLL_PP = (SCLL_PP + 1) x tI3CCLK
SCLL_PP is used to generate tLOW (I3C) timing.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SCLH_I3C</name>
                <description>SCL high duration, used for I3C messages (both in push-pull and open-drain phases), in number of kernel clocks cycles:
tSCLH_I3C = (SCLH_I3C + 1) x tI3CCLK
SCLH_I3C is used to generate both tHIGH (I3C) and tHIGH_MIXED timings.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SCLL_OD</name>
                <description>SCL low duration in open-drain phases, used for legacy I2C commands and for I3C open-drain phases (address header phase following a START, not a Repeated START), in number of kernel clocks cycles:
tSCLL_OD = (SCLL_OD + 1) x tI3CCLK
SCLL_OD is used to generate both tLOW (I2C) and tLOW_OD timings (max. of the two).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SCLH_I2C</name>
                <description>SCL high duration, used for legacy I2C commands, in number of kernel clocks cycles:
tSCLH_I2C = (SCLH_I2C + 1) x tI3CCLK
SCLH_I2C is used to generate tHIGH (I2C) timing.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_TIMINGR1</name>
            <displayName>I3C_TIMINGR1</displayName>
            <description>I3C timing register 1 </description>
            <addressOffset>0xa4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AVAL</name>
                <description>number of kernel clock cycles, that is used whatever I3C is acting as controller or target, to set the following MIPI I3C timings, like bus available condition time:
When the I3C is acting as target:
for bus available condition time: it must wait for (bus available condition) time to be elapsed after a stop and before issuing a start request for an IBI or a controller-role request (i.e. bus free condition is sustained for at least tAVAL). refer to MIPI timing tAVAL = 1 s. This timing is defined by:
tAVAL = (AVAL[7:0] + 2) x tI3CCLK
for bus idle condition time: it must wait for (bus idle condition) time to be elapsed after that both SDA and SCL are continuously high and stable before issuing a hot-join event. Refer to MIPI v1.1 timing tIDLE = 200 s . This timing is defined by:
tIDLE = (AVAL[7:0] + 2) x 200 x tI3CCLK
When the I3C is acting as controller, it can not stall the clock beyond a maximum stall time (i.e. stall the SCL clock low), as follows:
on first bit of assigned address during dynamic address assignment: it can not stall the clock beyond the MIPI timing tSTALLDAA = 15 ms. This timing is defined by:
tSTALLDAA = (AVAL[7:0] + 1) x 15000 x tI3CCLK
on ACK/NACK phase of I3C/I2C transfer, on parity bit of write data transfer, on transition bit of I3C read transfer: it can not stall the clock beyond the MIPI timing tSTALL = 100 s. This timing is defined by:
tSTALL = (AVAL[7:0] + 1) x 100 x tI3CCLK
Whatever the I3C is acting as controller or as (controller-capable) target, during a controller-role hand-off procedure:
The new controller must wait for a time (refer to MIPI timing tNEWCRLock) before pulling SDA low (i.e. issuing a start). And the active controller must wait for the same time while monitoring new controller and before testing the new controller by pulling SDA low. This time to wait is dependent on the defined I3C_TIMINGR1.ANSCR[1:0], as follows:
If ASNCR[1:0]=00: tNEWCRLock = (AVAL[7:0] + 1)  x tI3CCLK
If ASNCR[1:0]=01: tNEWCRLock = (AVAL[7:0] + 1) x 100 x tI3CCLK
If ASNCR[1:0]=10: tNEWCRLock = (AVAL[7:0] + 1) x 2000 x tI3CCLK
If ASNCR[1:0]=11: tNEWCRLock = (AVAL[7:0] + 1) x 50000 x tI3CCLK</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ASNCR</name>
                <description>activity state of the new controller (when I3C is acting asactive- controller)
This field indicates the time to wait before being accessed as new target, refer to the other field AVAL[7:0].
This field can be modified only when the I3C is acting as controller.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FREE</name>
                <description>number of kernel clocks cycles that is used to set some MIPI timings like bus free condition time (when the I3C is acting as controller)
When the I3C is acting as controller:
for I3C start timing: it must wait for (bus free condition) time to be elapsed after a stop and before a start, refer to MIPI timings (I3C) tCAS and (I2C) tBUF. These timings are defined by:
tBUF= tCAS = [ (FREE[6:0]  + 1) x 2(0,5 + SDA_HD)] x tI3CCLK
Note: for pure I3C bus: tCASmin= 38,4 ns.
Note: for pure I3C bus: tCASmax=1s, 100s, 2ms, 50ms for respectively ENTAS0,1,2, and 3.
Note: for mixed bus with I2C fm+ device: tBUFmin = 0,5 s.
Note: for mixed bus with I2C fm device: tBUFmin = 1,3 s.
for I3C repeated start timing: it must wait for time to be elapsed after a repeated start (i.e. SDA is de-asserted) and before driving SCL low, refer to. MIPI timing tCASr. This timing is defined by:
tCASr = [ (FREE[6:0] + 1) x 2(0,5 + SDA_HD)] x tI3CCLK
for I3C stop timing: it must wait for time to be elapsed after that the SCL clock is driven high and before the stop condition (i.e. SDA is asserted). This timing is defined by:
tCBP = (FREE[6:0] + 1) x tI3CCLK
for I3C repeated start timing (T-bit when controller ends read with repeated start followed by stop): it must wait for time to be elapsed after that the SCL clock is driven high and before the repeated start condition (i.e. SDA is de-asserted). This timing is defined by:
tCBSr = (FREE[6:0] + 1) x tI3CCLK</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SDA_HD</name>
                <description>SDA hold time (when the I3C is acting as controller), in number of kernel clocks cycles (refer to MIPI timing SDA hold time in push-pull tHD_PP):</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SDA hold time = 0,5 x tI3CCLK</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SDA hold time = 1,5 x tI3CCLK</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
