sa3mv3g/jerry/tools/ozone/STM32H563.svd
        </registers>
    </peripheral>
	<peripheral derivedFrom="SAI1">
      <name>SEC_SAI1</name>
      <baseAddress>0x50015400</baseAddress>
    </peripheral>
	<peripheral derivedFrom="SAI1">
      <name>SAI2</name>
      <baseAddress>0x40015800</baseAddress>
	  <interrupt>
        <name>SAI2</name>
        <description>SAI2 global interrupt</description>
        <value>89</value>
      </interrupt>
    </peripheral>
	<peripheral derivedFrom="SAI1">
      <name>SEC_SAI2</name>
      <baseAddress>0x50015800</baseAddress>
    </peripheral>
	<peripheral>
        <name>SBS</name>
        <description>SBS register block</description>
        <groupName>SBS</groupName>
		<baseAddress>0x44000400</baseAddress>
        <addressBlock>
          <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>SBS_HDPLCR</name>
            <displayName>SBS_HDPLCR</displayName>
            <description>SBS temporal isolation control register </description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B4</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INCR_HDPL</name>
                <description>increment HDPL value
Other: all other values allow a HDPL level increment.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>no increment</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6A</name>
                    <description>recommended value to increment HDPL level by one</description>
                    <value>0x6A</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_HDPLSR</name>
            <displayName>SBS_HDPLSR</displayName>
            <description>SBS temporal isolation status register </description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDPL</name>
                <description>temporal isolation level
This bitfield returns the current temporal isolation level.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>HDPL0, RSS</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x51</name>
                    <description>HDPL1, iRoT</description>
                    <value>0x51</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8A</name>
                    <description>HDPL2, uRoT</description>
                    <value>0x8A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6F</name>
                    <description>HDPL3, application (secure/non-secure)</description>
                    <value>0x6F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_NEXTHDPLCR</name>
            <displayName>SBS_NEXTHDPLCR</displayName>
            <description>SBS next HDPL control register </description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>NEXTHDPL</name>
                <description>index to point to a higher HDPL than the current one
Index to add to the current HDPL to point (through OBK-HDPL) to the next secure storage areas (OBK-HDPL = HDPL + NEXTHDPL). See  for more details.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_DBGCR</name>
            <displayName>SBS_DBGCR</displayName>
            <description>SBS debug control register </description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AP_UNLOCK</name>
                <description>access port unlock
Write 0xB4 to this bitfield to open the device access port.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DBG_UNLOCK</name>
                <description>debug unlock when DBG_AUTH_HDPL is reached
Write 0xB4 to this bitfield to open the debug when HDPL in SBS_HDPLSR equals to DBG_AUTH_HDPL in this register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DBG_AUTH_HDPL</name>
                <description>authenticated debug temporal isolation level
Writing to this bitfield defines at which HDPL the authenticated debug opens.
Note: Writing any other values is ignored. Reading any other value means the debug never opens.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x51</name>
                    <description>HDPL1</description>
                    <value>0x51</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8A</name>
                    <description>HDPL2</description>
                    <value>0x8A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6F</name>
                    <description>HDPL3</description>
                    <value>0x6F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBG_AUTH_SEC</name>
                <description>control debug opening secure/non-secure
Write 0xB4 to this bitfield to open debug for secure and non-secure.
Writing any other values only open non-secure.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_DBGLOCKR</name>
            <displayName>SBS_DBGLOCKR</displayName>
            <description>SBS debug lock register </description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B4</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DBGCFG_LOCK</name>
                <description>debug configuration lock
Reading this bitfield returns 0x6A if the bitfield value is different from 0xB4.
0xC3 is the recommended value to lock the debug configuration using this bitfield.
Other: Writes to SBS_DBGCR ignored</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>Writes to SBS_DBGCR allowed (default)</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_RSSCMDR</name>
            <displayName>SBS_RSSCMDR</displayName>
            <description>SBS RSS command register </description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RSSCMD</name>
                <description>RSS command
The application can use this bitfield to pass on a command to the RSS, executed at the next reset.
When RSSCMD different  0 and PRODUCT_STATE is in Open, then the system always boots on RSS whatever is the boot pin value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_EPOCHSELCR</name>
            <displayName>SBS_EPOCHSELCR</displayName>
            <description>SBS EPOCH selection control register </description>
            <addressOffset>0xa0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EPOCH_SEL</name>
                <description>select EPOCH value to be sent to the SAES
1x: EPOCH forced to zero (value used to retrieve PUF reference value at boot time)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SEC_EPOCH counter input selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>NS_EPOCH (non-secure) input selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_SECCFGR</name>
            <displayName>SBS_SECCFGR</displayName>
            <description>SBS security mode configuration control register </description>
            <addressOffset>0xc0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SBSSEC</name>
                <description>SBS clock control, memory-erase status register and compensation cell register security enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SBS_MESR, SBS_CCCSR, SBS_CCVALR, SBS_CCSWCR registers accessible through secure or non-secure transaction</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SBS_MESR, SBS_CCCSR, SBS_CCVALR, SBS_CCSWCR registers only accessible through secure transaction</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLASSBSEC</name>
                <description>ClassB security enable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SBS_CFGR2 register accessible through secure or non-secure transaction</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SBS_CFGR2 register only accessible through secure transaction</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FPUSEC</name>
                <description>FPU security enable
Note: This bit can only be written through privilege transaction.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SBS_FPUIMP register accessible through secure or non-secure transaction</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SBS_FPUIMP register only accessible through secure transaction</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SDCE_SEC_EN</name>
                <description>control accessibility of SMPS_DIV_CLOCK _EN in SBS_PMCR</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SMPS_DIV_CLOCK _EN accessible through a secure or non-secure transaction</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SMPS_DIV_CLOCK _EN only accessible through a secure transaction</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_PMCR</name>
            <displayName>SBS_PMCR</displayName>
            <description>SBS product mode and configuration register </description>
            <addressOffset>0x100</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BOOSTEN</name>
                <description>booster enable
Set this bit to reduce the total harmonic distortion of the analog switch when the processor supply is below 2.7 V. The booster can be activated to guaranty AC performance on analog switch when the supply is below 2.7 V. When the booster is activated, the analog switch performances are the same as with the full voltage range.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Booster disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Booster enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BOOSTVDDSEL</name>
                <description>booster VDD selection
Note: Booster must not be used when VDDA  2.7 V, but VDD   2.7 V (add current consumption).
When both VDD  2.7 V and VDDA  2.7 V, booster is needed to get full AC performances from I/O analog switches.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>VDDA is selected as VBOOSTER supply (BOOSTE = 0)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>VDD is selected as VBOOSTER supply (regardless BOOSTEN that must be cleared to avoid unwanted power consumption)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PB6_FMPLUS</name>
                <description>Fast-mode Plus command on PB(6)</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Fast-mode Plus mode on PB(6) is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Fast-mode Plus mode on PB(6) is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PB7_FMPLUS</name>
                <description>Fast-mode Plus command on PB(7)</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Fast-mode Plus mode on PB(7) is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Fast mode plus mode on PB(7) is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PB8_FMPLUS</name>
                <description>Fast-mode Plus command on PB(8)</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Fast-mode Plus mode on PB(8) is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Fast-mode Plus mode on PB(8) is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PB9_FMPLUS</name>
                <description>Fast-mode Plus command on PB(9)</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Fast-mode Plus mode on PB(9) disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Fast-mode Plus mode on PB(9) enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ETH_SEL_PHY</name>
                <description>Ethernet PHY interface selection
Other: reserved</description>
                <bitOffset>21</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>GMII or MII</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>reserved (RGMII)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>RMII</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_FPUIMR</name>
            <displayName>SBS_FPUIMR</displayName>
            <description>SBS FPU interrupt mask register </description>
            <addressOffset>0x104</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000001F</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FPU_IE</name>
                <description>FPU interrupt enable
Set and cleared by software to enable the Cortex-M33 FPU interrupts
FPU_IE[5]: inexact interrupt enable (interrupt disabled at reset)
FPU_IE[4]: input abnormal interrupt enable
FPU_IE[3]: overflow interrupt enable
FPU_IE[2]: underflow interrupt enable
FPU_IE[1]: divide-by-zero interrupt enable
FPU_IE[0]: invalid operation interrupt enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
